<!-- dflook/terraform-github-actions {"workspace":"trixie","backend_type":"remote","plan_modifier":"9ebdcefa28ba58bd0b2d6fc795d575dba5541517ae08f41ba0945779d06b671e","backend":"ac17402b6d387829d9b5f0e694e30e6aab8535072430e86bd3c04de3a2a019d4","plan_job_ref":"Job Test actions using target, replace, and exclude #38 at https://github.com/dflook/terraform-github-actions/actions/runs/23685838897","plan_hash":"d37ad1e47620aad2ec90baa32ac9d20ad8a66c076aa27e56436152e701fbe62b","plan_text_format":"diff","version":"99.0.0","closed":true} -->
Terraform plan in __tests/workflows/test-target-replace-exclude__ in the __trixie__ workspace
Targeting resources: `random_string.foreach["hello"]`
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 1 to add, 0 to change, 1 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
!~  foreach = "WDhjpEOjTE" -> (known after apply)
╷
│ Warning: Resource targeting is in effect
│ 
│ You are creating a plan with the -target option, which means that the
│ result of this plan may not represent all of the changes requested by the
│ current configuration.
│ 		
│ The -target option is not for routine use, and is provided only for
│ exceptional situations such as recovering from errors or mistakes, or when
│ Terraform specifically suggests to use it as part of an error message.
╵
```
</details>

:white_check_mark: Plan applied in [Test actions using target, replace, and exclude #38](https://github.com/dflook/terraform-github-actions/actions/runs/23685838897)
<details open><summary>Outputs</summary>

```hcl
count   = "LHW36VvdSB"
foreach = "7ea8xFcFjg"
```
</details>